package goldminer_1219;

public class Main {

	public static void main(String[] args) {
		// TODO 自动生成的方法存根
		/*你要开发一座金矿，地质勘测学家已经探明了这座金矿中的资源分布，
		 * 并用大小为 m * n 的网格 grid 进行了标注。每个单元格中的整数
		 * 就表示这一单元格中的黄金数量；如果该单元格是空的，那么就是 0。
		为了使收益最大化，矿工需要按以下规则来开采黄金：
		每当矿工进入一个单元，就会收集该单元格中的所有黄金。
		矿工每次可以从当前位置向上下左右四个方向走。
		每个单元格只能被开采（进入）一次。
		不得开采（进入）黄金数目为 0 的单元格。
		矿工可以从网格中 任意一个 有黄金的单元格出发或者是停止。*/
		int[][] grid = { { 0, 6, 0 }, { 5, 8, 7 }, { 0, 9, 0 } };
		System.out.println(new Solution().getMaximumGold(grid));
	}

}
